{
  "locales": {
    "en": {
      "title": "<span class='text-primary'>Professional</span> Experience",
      "description": "An overview of my work experience and career achievements in software development."
    },
    "es": {
      "title": "<span class='text-primary'>Experiencia</span> Profesional",
      "description": "Una visión general de mi experiencia laboral y logros profesionales en desarrollo de software."
    },
    "fr": {
      "title": "Expérience <span class='text-primary'>Professionnelle</span>",
      "description": "Un aperçu de mon expérience professionnelle et de mes réalisations dans le développement logiciel."
    },
    "zh": {
      "title": "<span class='text-primary'>专业</span> 经验",
      "description": "展示我在软件开发领域的工作经验和职业成就。"
    }
  },
  "items": [
    {
      "id": "experience_item_1",
      "place": "@link{places.coursera}",
      "period": ["2024/04", "Present"],
      "locales": {
        "en": {
          "title": "Frontend Developer",
          "description": "Project: IVY – AI Automations for Sales Teams (React.js, Redux, MUI, Flask). Designed AI-powered dashboards that boosted sales team productivity by streamlining workflow and reporting. Developed highly optimized UI components with React.memo and code-splitting, reducing load time and enhancing responsiveness. Implemented unit and integration tests (Jest, Cypress) to ensure reliable, high-quality releases."
        },
        "es": {
          "title": "Desarrollador Frontend",
          "description": "Proyecto: IVY – Automatizaciones de IA para equipos de ventas (React.js, Redux, MUI, Flask). Diseñé paneles impulsados por IA que mejoraron la productividad del equipo de ventas mediante la optimización de flujos de trabajo e informes. Desarrollé componentes de UI altamente optimizados con React.memo y división de código, reduciendo tiempos de carga y mejorando la capacidad de respuesta. Implementé pruebas unitarias e integrales (Jest, Cypress) para garantizar lanzamientos confiables y de alta calidad."
        },
        "fr": {
          "title": "Développeur Frontend",
          "description": "Projet : IVY – Automatisations IA pour les équipes commerciales (React.js, Redux, MUI, Flask). Conception de tableaux de bord alimentés par l'IA améliorant la productivité grâce à l'optimisation des flux de travail et des rapports. Développement de composants UI hautement optimisés avec React.memo et code-splitting, réduisant le temps de chargement et améliorant la réactivité. Mise en place de tests unitaires et d'intégration (Jest, Cypress) garantissant des livraisons fiables et de haute qualité."
        },
        "zh": {
          "title": "前端开发工程师",
          "description": "项目：IVY – 销售团队AI自动化（React.js, Redux, MUI, Flask）。设计AI驱动的仪表板，通过优化工作流程和报告，提高销售团队生产力。构建高性能UI组件，使用React.memo和代码分割，提升加载速度和响应性能。实现单元和集成测试（Jest, Cypress），确保发布质量和稳定性。"
        }
      }
    },
    {
      "id": "experience_item_2",
      "place": "@link{places.adobe}",
      "period": ["2022/03", "2024/12"],
      "locales": {
        "en": {
          "title": "Senior Frontend Developer",
          "description": "Taxiye (Passenger App) – Developed a custom ride-booking & delivery system (Next.js, Strapi CMS, Node.js, PostgreSQL), improving booking speed and overall UX. ELTNT Tours & Travel – Built a tour package booking platform (React, Ant Design, .NET), increasing user engagement and sales. Houfa Africa (Security Service) – Led frontend development of a real-time alert system (React, Tailwind, Redux, Node.js, Flutter), delivering a pixel-perfect UI and improving operational efficiency."
        },
        "es": {
          "title": "Desarrollador Frontend Senior",
          "description": "Taxiye (Aplicación de Pasajeros) – Desarrollé un sistema personalizado de reservas de viajes y entregas (Next.js, Strapi CMS, Node.js, PostgreSQL), mejorando la velocidad de reserva y la experiencia de usuario. ELTNT Tours & Travel – Construí una plataforma de reservas de paquetes turísticos (React, Ant Design, .NET), aumentando la interacción de los usuarios y las ventas. Houfa Africa (Servicio de Seguridad) – Lideré el desarrollo frontend de un sistema de alertas en tiempo real (React, Tailwind, Redux, Node.js, Flutter), entregando una UI precisa y mejorando la eficiencia operativa."
        },
        "fr": {
          "title": "Développeur Frontend Senior",
          "description": "Taxiye (Application Passager) – Développement d'un système personnalisé de réservation et livraison (Next.js, Strapi CMS, Node.js, PostgreSQL), optimisant la rapidité et l'expérience utilisateur. ELTNT Tours & Travel – Création d'une plateforme de réservation de forfaits touristiques (React, Ant Design, .NET), augmentant l'engagement et les ventes. Houfa Africa (Service de Sécurité) – Supervision du développement frontend d'un système d'alerte en temps réel (React, Tailwind, Redux, Node.js, Flutter), livrant une UI parfaite et améliorant l'efficacité opérationnelle."
        },
        "zh": {
          "title": "高级前端开发工程师",
          "description": "Taxiye（乘客应用）– 构建定制乘车和配送系统（Next.js, Strapi CMS, Node.js, PostgreSQL），提升预订速度和用户体验。ELTNT旅游 – 开发旅游套餐预订平台（React, Ant Design, .NET），增加用户参与度和销售额。Houfa Africa（安全服务）– 领导实时警报系统前端开发（React, Tailwind, Redux, Node.js, Flutter），实现像素级UI，提高运营效率。"
        }
      }
    },
    {
      "id": "experience_item_3",
      "place": "@link{places.apple}",
      "period": ["2023/07", "2024/05"],
      "locales": {
        "en": {
          "title": "FullStack Developer",
          "description": "ReserveXp (Travel SaaS) – Developed a multi-tenant subscription-based SaaS platform (React, Node.js, MongoDB) with secure role-based access. Passio (Super App) – Led development of a multi-service platform (e-commerce, taxi, delivery) using React, MUI, Node.js, Flutter. Curewantri (Telemedicine App) – Built subscription-based medical consultation platform (React Native, Laravel, MySQL), improving patient engagement. LiveGamer (Sports Betting) – Integrated real-time odds APIs & Stripe payments, optimizing transaction efficiency."
        },
        "es": {
          "title": "Desarrollador FullStack",
          "description": "ReserveXp (SaaS de Viajes) – Desarrollé una plataforma SaaS multi-inquilino basada en suscripciones (React, Node.js, MongoDB) con acceso seguro basado en roles. Passio (Super App) – Lideré el desarrollo de una plataforma multi-servicio (e-commerce, taxi, entrega) usando React, MUI, Node.js, Flutter. Curewantri (App de Telemedicina) – Construí una plataforma de consultas médicas por suscripción (React Native, Laravel, MySQL), mejorando la interacción con los pacientes. LiveGamer (Apuestas Deportivas) – Integré APIs de probabilidades en tiempo real y pagos con Stripe, optimizando la eficiencia de las transacciones."
        },
        "fr": {
          "title": "Développeur FullStack",
          "description": "ReserveXp (SaaS de Voyage) – Développement d'une plateforme SaaS multi-locataire basée sur l'abonnement (React, Node.js, MongoDB) avec accès sécurisé par rôle. Passio (Super App) – Supervision du développement d'une plateforme multi-services (e-commerce, taxi, livraison) utilisant React, MUI, Node.js, Flutter. Curewantri (Application de Télémédecine) – Création d'une plateforme de consultation médicale par abonnement (React Native, Laravel, MySQL), améliorant l'engagement des patients. LiveGamer (Paris Sportifs) – Intégration d'APIs d'odds en temps réel et Stripe, optimisant les transactions."
        },
        "zh": {
          "title": "全栈开发工程师",
          "description": "ReserveXp（旅游SaaS）– 开发多租户订阅制SaaS平台（React, Node.js, MongoDB），支持基于角色的安全访问。Passio（超级应用）– 领导多服务平台开发（电商、出租车、配送），使用React, MUI, Node.js, Flutter。Curewantri（远程医疗应用）– 构建订阅式医疗咨询平台（React Native, Laravel, MySQL），提高患者参与度。LiveGamer（体育博彩）– 集成实时赔率API与Stripe支付，提高交易效率。"
        }
      }
    },
    {
      "id": "experience_item_4",
      "place": "@link{places.yerras}",
      "period": ["2020/10", "2022/01"],
      "locales": {
        "en": {
          "title": "Full-Stack Developer",
          "description": "Developed an agriculture e-commerce platform (React, Node.js, PostgreSQL), improving digital trade efficiency. Designed financial management dashboards, streamlining SME transactions and reducing manual errors."
        },
        "es": {
          "title": "Desarrollador Full-Stack",
          "description": "Desarrollé una plataforma de comercio electrónico agrícola (React, Node.js, PostgreSQL), mejorando la eficiencia del comercio digital. Diseñé paneles de gestión financiera, optimizando transacciones de PYMEs y reduciendo errores manuales."
        },
        "fr": {
          "title": "Développeur Full-Stack",
          "description": "Développement d'une plateforme de commerce électronique agricole (React, Node.js, PostgreSQL), améliorant l'efficacité du commerce numérique. Conception de tableaux de bord de gestion financière, rationalisant les transactions pour les PME et réduisant les erreurs manuelles."
        },
        "zh": {
          "title": "全栈开发工程师",
          "description": "开发农业电子商务平台（React, Node.js, PostgreSQL），提升数字贸易效率。设计财务管理仪表板，优化中小企业交易流程并减少人工错误。"
        }
      }
    },
    {
      "id": "experience_item_5",
      "place": "@link{places.uxStudio}",
      "period": ["2019/01", "2020/09"],
      "locales": {
        "en": {
          "title": "IT Officer",
          "description": "Managed core banking IT infrastructure, ensuring high system uptime and security. Developed automation tools that streamlined daily operations, reducing manual effort and operational risk."
        },
        "es": {
          "title": "Oficial de TI",
          "description": "Gestioné la infraestructura de TI bancaria principal, asegurando alta disponibilidad y seguridad del sistema. Desarrollé herramientas de automatización que optimizaron las operaciones diarias, reduciendo el esfuerzo manual y el riesgo operativo."
        },
        "fr": {
          "title": "Officier TI",
          "description": "Gestion de l'infrastructure informatique bancaire principale, assurant une haute disponibilité et sécurité du système. Développement d'outils d'automatisation pour rationaliser les opérations quotidiennes, réduisant le travail manuel et les risques opérationnels."
        },
        "zh": {
          "title": "IT专员",
          "description": "管理核心银行IT基础设施，确保系统高可用性和安全性。开发自动化工具，简化日常操作，减少人工工作量和操作风险。"
        }
      }
    }
  ]
}
