{
    "locales": {
        "en": {
            "title": "My <span class='text-primary'>Portfolio</span>",
            "description": "Explore a selection of my recent projects and creative works."
        },
        "es": {
            "title": "Mi <span class='text-primary'>Portafolio</span>",
            "description": "Explora una selección de mis proyectos recientes y trabajos creativos."
        },
        "fr": {
            "title": "Mon <span class='text-primary'>Portfolio</span>",
            "description": "Découvrez une sélection de mes projets récents et œuvres créatives."
        },
        "zh": {
            "title": "我的<span class='text-primary'>作品集</span>",
            "description": "浏览我最近的一些项目和创意作品。"
        }
    },

    "subcategories": [
        {
            "id": "productivity",
            "locales": {
                "en": {"title": "Productivity"},
                "es": {"title": "Productividad"},
                "fr": {"title": "Productivité"},
                "zh": {"title": "生产力"}
            }
        },
        {
            "id": "utilities",
            "locales": {
                "en": {"title": "Utilities"},
                "es": {"title": "Utilidades"},
                "fr": {"title": "Utilitaires"},
                "zh": {"title": "工具"}
            }
        },
        {
            "id": "social",
            "locales": {
                "en": {"title": "Social"},
                "es": {"title": "Social"},
                "fr": {"title": "Social"},
                "zh": {"title": "社交"}
            }
        }
    ],

    "items": {
        "productivity": [
            {
                "id": "ivy",
                "title": "Ivy",
                "logoUrl": "images/portfolio/ivy.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Ivy</b> is an intelligent sales leads generator system designed to accelerate business growth. With the assistance of advanced AI, Ivy identifies and targets potential customers specifically suited to your business needs, streamlining the prospecting process and maximizing conversion opportunities.",
                        "tags": ["app", "business", "AI", "sales"]
                    },
                    "es": {
                        "description": "<b>Ivy</b> es un sistema inteligente generador de leads de ventas diseñado para acelerar el crecimiento empresarial. Con la asistencia de IA avanzada, Ivy identifica y apunta a clientes potenciales adecuados para su negocio, optimizando el proceso de prospección y maximizando las oportunidades de conversión.",
                        "tags": ["aplicación", "negocios", "IA", "ventas"]
                    },
                    "fr": {
                        "description": "<b>Ivy</b> est un système intelligent de génération de leads commerciaux conçu pour accélérer la croissance des entreprises. Avec l'aide d'une IA avancée, Ivy identifie et cible les clients potentiels adaptés à vos besoins, simplifiant le processus de prospection et maximisant les opportunités de conversion.",
                        "tags": ["application", "business", "IA", "ventes"]
                    },
                    "zh": {
                        "description": "<b>Ivy</b> 是一个旨在加速业务增长的智能销售线索生成系统。借助先进的人工智能，Ivy 能够识别并定位适合您业务需求的潜在客户，简化潜在客户开发流程并最大化转化机会。",
                        "tags": ["应用", "商业", "AI", "销售"]
                    }
                }
            },
            {
                "id": "passio",
                "title": "Passio",
                "logoUrl": "images/portfolio/passio.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Passio</b> is a comprehensive ride-hailing and logistics platform based in Cameroon. We built a complete ecosystem featuring dedicated applications for passengers, drivers, and company management. The platform includes ride-hailing services, delivery options, and administrative tools to manage transportation operations seamlessly.",
                        "tags": ["app", "ride-hailing", "delivery", "cameroon"]
                    },
                    "es": {
                        "description": "<b>Passio</b> es una plataforma integral de transporte y logística con sede en Camerún. Construimos un ecosistema completo con aplicaciones dedicadas para pasajeros, conductores y la gestión de la empresa. La plataforma incluye servicios de transporte, opciones de entrega y herramientas administrativas.",
                        "tags": ["aplicación", "transporte", "entrega", "camerún"]
                    },
                    "fr": {
                        "description": "<b>Passio</b> est une plateforme complète de covoiturage et de logistique basée au Cameroun. Nous avons construit un écosystème complet comprenant des applications dédiées aux passagers, aux chauffeurs et à la gestion d'entreprise. La plateforme inclut des services de transport, de livraison et des outils administratifs.",
                        "tags": ["application", "VTC", "livraison", "cameroun"]
                    },
                    "zh": {
                        "description": "<b>Passio</b> 是一个位于喀麦隆的综合网约车和物流平台。我们构建了一个完整的生态系统，包括面向乘客、司机和公司管理的专用应用程序。该平台涵盖网约车服务、配送选项以及用于无缝管理运输运营的管理工具。",
                        "tags": ["应用", "网约车", "配送", "喀麦隆"]
                    }
                }
            },
            {
                "id": "taxiye",
                "title": "Taxiye",
                "logoUrl": "images/portfolio/taxiye.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Taxiye</b> is a leading ride-hailing application operating in Ethiopia, designed to modernize urban transportation. The app connects passengers with drivers for fast and reliable travel, offering features like real-time tracking, fare estimation, and secure payment options to ensure a smooth commuting experience.",
                        "tags": ["app", "ride-hailing", "ethiopia", "transport"]
                    },
                    "es": {
                        "description": "<b>Taxiye</b> es una aplicación líder de transporte privado que opera en Etiopía, diseñada para modernizar el transporte urbano. La aplicación conecta a pasajeros con conductores para viajes rápidos y confiables, ofreciendo funciones como seguimiento en tiempo real, estimación de tarifas y opciones de pago seguro.",
                        "tags": ["aplicación", "transporte", "etiopía", "viajes"]
                    },
                    "fr": {
                        "description": "<b>Taxiye</b> est une application de VTC de premier plan opérant en Éthiopie, conçue pour moderniser le transport urbain. L'application met en relation les passagers avec les chauffeurs pour des trajets rapides et fiables, offrant des fonctionnalités telles que le suivi en temps réel, l'estimation des tarifs et des options de paiement sécurisées.",
                        "tags": ["application", "VTC", "éthiopie", "transport"]
                    },
                    "zh": {
                        "description": "<b>Taxiye</b> 是在埃塞俄比亚运营的领先网约车应用程序，旨在实现城市交通的现代化。该应用程序将乘客与司机连接起来，提供快速可靠的出行服务，并具有实时跟踪、票价估算和安全支付选项等功能。",
                        "tags": ["应用", "网约车", "埃塞俄比亚", "交通"]
                    }
                }
            },
            {
                "id": "supertrainer",
                "title": "Supertrainer",
                "logoUrl": "images/portfolio/supertrainer.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Supertrainer</b> is a complete e-learning platform designed to bridge the gap between education and technology. It creates a unified space where teachers and students are joined together for seamless interaction, course management, and digital learning experiences.",
                        "tags": ["app", "education", "e-learning", "school"]
                    },
                    "es": {
                        "description": "<b>Supertrainer</b> es una plataforma completa de e-learning diseñada para cerrar la brecha entre la educación y la tecnología. Crea un espacio unificado donde profesores y estudiantes se unen para una interacción fluida, gestión de cursos y experiencias de aprendizaje digital.",
                        "tags": ["aplicación", "educación", "e-learning", "escuela"]
                    },
                    "fr": {
                        "description": "<b>Supertrainer</b> est une plateforme complète d'apprentissage en ligne conçue pour combler le fossé entre l'éducation et la technologie. Elle crée un espace unifié où enseignants et étudiants se rejoignent pour une interaction fluide, la gestion des cours et des expériences d'apprentissage numérique.",
                        "tags": ["application", "éducation", "e-learning", "école"]
                    },
                    "zh": {
                        "description": "<b>Supertrainer</b> 是一个完整的在线学习平台，旨在弥合教育与技术之间的差距。它创造了一个统一的空间，将教师和学生连接在一起，实现无缝互动、课程管理和数字化学习体验。",
                        "tags": ["应用", "教育", "在线学习", "学校"]
                    }
                }
            },
            {
                "id": "examtime",
                "title": "ExamTime",
                "logoUrl": "images/portfolio/examtime.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-solid fa-globe", "href": "https://examtime.com", "id": "Web App"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>ExamTime</b> is a dedicated mobile and web application built as an entrance exam preparation tool for Grade 12 students. It provides comprehensive study resources, practice tests, and progress tracking to help students effectively prepare for their final exams and secure their academic future.",
                        "tags": ["app", "web", "education", "exam prep"]
                    },
                    "es": {
                        "description": "<b>ExamTime</b> es una aplicación web y móvil dedicada, construida como herramienta de preparación para exámenes de ingreso para estudiantes de grado 12. Proporciona recursos de estudio completos, exámenes de práctica y seguimiento del progreso para ayudar a los estudiantes a prepararse eficazmente.",
                        "tags": ["aplicación", "web", "educación", "examen"]
                    },
                    "fr": {
                        "description": "<b>ExamTime</b> est une application mobile et web dédiée, conçue comme un outil de préparation aux examens d'entrée pour les élèves de 12e année. Elle fournit des ressources d'étude complètes, des tests pratiques et un suivi des progrès pour aider les étudiants à réussir leurs examens finaux.",
                        "tags": ["application", "web", "éducation", "examen"]
                    },
                    "zh": {
                        "description": "<b>ExamTime</b> 是专为12年级学生打造的移动和Web应用程序，用作入学考试准备工具。它提供全面的学习资源、模拟测试和进度跟踪，帮助学生有效备考并确保他们的学术未来。",
                        "tags": ["应用", "网页", "教育", "备考"]
                    }
                }
            },
            {
                "id": "prophecius",
                "title": "Prophecius",
                "logoUrl": "images/portfolio/prophecius.png",
                "links": [
                    {"faIcon": "fa-solid fa-globe", "href": "https://prophecius.com", "id": "Website"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Prophecius.com</b> is a professional web application developed for a software agency. It serves as a digital hub for clients to discover services, request custom web and app development, and manage their projects. The platform highlights technical expertise and facilitates seamless client onboarding.",
                        "tags": ["web", "agency", "development", "services"]
                    },
                    "es": {
                        "description": "<b>Prophecius.com</b> es una aplicación web profesional desarrollada para una agencia de software. Sirve como un centro digital para que los clientes descubran servicios, soliciten desarrollo personalizado de aplicaciones y gestionen sus proyectos. La plataforma destaca la experiencia técnica y facilita la incorporación de clientes.",
                        "tags": ["web", "agencia", "desarrollo", "servicios"]
                    },
                    "fr": {
                        "description": "<b>Prophecius.com</b> est une application web professionnelle développée pour une agence de logiciels. Elle sert de hub numérique permettant aux clients de découvrir les services, de demander des développements personnalisés et de gérer leurs projets. La plateforme met en valeur l'expertise technique et facilite l'intégration des clients.",
                        "tags": ["web", "agence", "développement", "services"]
                    },
                    "zh": {
                        "description": "<b>Prophecius.com</b> 是为软件代理商开发的专业Web应用程序。它作为一个数字中心，供客户发现服务、请求定制Web和应用程序开发以及管理他们的项目。该平台突出了技术专长并促进了无缝的客户入驻。",
                        "tags": ["网页", "代理", "开发", "服务"]
                    }
                }
            }
        ],

        "utilities": [
            {
                "id": "houfa",
                "title": "Houfa",
                "logoUrl": "images/portfolio/houfa.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"},
                    {"faIcon": "fa-brands fa-windows", "href": "https://windows.com", "id": "Windows Store"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Houfa</b> is a vital safety and security service developed for Nigeria. It empowers users to mark the safety status of specific areas based on their real-time location. Areas are flagged and color-coded based on user reports and situational analysis, helping the community stay informed and safe.",
                        "tags": ["app", "safety", "security", "nigeria"]
                    },
                    "es": {
                        "description": "<b>Houfa</b> es un servicio vital de seguridad y protección desarrollado para Nigeria. Permite a los usuarios marcar el estado de seguridad de áreas específicas según su ubicación en tiempo real. Las áreas se marcan según los informes de los usuarios y el análisis de la situación, ayudando a la comunidad a mantenerse informada y segura.",
                        "tags": ["aplicación", "seguridad", "protección", "nigeria"]
                    },
                    "fr": {
                        "description": "<b>Houfa</b> est un service de sécurité essentiel développé pour le Nigeria. Il permet aux utilisateurs de signaler l'état de sécurité de zones spécifiques en fonction de leur localisation en temps réel. Les zones sont signalées en fonction des rapports des utilisateurs, aidant la communauté à rester informée et en sécurité.",
                        "tags": ["application", "sécurité", "sûreté", "nigeria"]
                    },
                    "zh": {
                        "description": "<b>Houfa</b> 是为尼日利亚开发的一项重要安全保障服务。它允许用户根据其实时位置标记特定区域的安全状态。根据用户报告和局势分析对区域进行标记，帮助社区保持知情和安全。",
                        "tags": ["应用", "安全", "保障", "尼日利亚"]
                    }
                }
            },

            {
                "id": "enswag",
                "title": "enswag",
                "logoUrl": "images/portfolio/enswag.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Snappy</b> is your ultimate photography app, empowering you to capture and edit stunning images effortlessly. With its intuitive interface, Snappy provides a wide range of powerful tools and filters to enhance your photos and bring out your creativity. Whether you're a professional photographer or just a hobbyist, Snappy offers features like manual controls, advanced editing options, and AI-powered enhancements to take your photography to the next level.",
                        "tags": ["app", "photography", "camera"]
                    },
                    "es": {
                        "description": "<b>Snappy</b> es tu aplicación definitiva de fotografía, que te permite capturar y editar imágenes impresionantes sin esfuerzo. Con su interfaz intuitiva, Snappy ofrece una amplia gama de herramientas y filtros poderosos para mejorar tus fotos y potenciar tu creatividad. Ya seas un fotógrafo profesional o simplemente un aficionado, Snappy ofrece funciones como controles manuales, opciones de edición avanzadas y mejoras impulsadas por inteligencia artificial para llevar tu fotografía al siguiente nivel.",
                        "tags": ["aplicación", "fotografía", "cámara"]
                    },
                    "fr": {
                        "description": "<b>Snappy</b> est votre application ultime de photographie, vous permettant de capturer et d'éditer des images époustouflantes sans effort. Avec son interface intuitive, Snappy propose une large gamme d'outils puissants et de filtres pour améliorer vos photos et stimuler votre créativité. Que vous soyez un photographe professionnel ou simplement un amateur, Snappy offre des fonctionnalités telles que les commandes manuelles, les options d'édition avancées et les améliorations alimentées par l'IA pour pousser votre photographie à un niveau supérieur.",
                        "tags": ["application", "photographie"]
                    },
                    "zh": {
                        "description": "<b>Snappy</b> 是您的终极摄影应用，可轻松捕捉和编辑令人惊叹的图像。借助其直观的界面，Snappy 提供了各种强大的工具和滤镜，可增强您的照片并释放您的创造力。无论您是专业摄影师还是业余爱好者，Snappy 都提供诸如手动控制、高级编辑选项和基于人工智能的增强功能，将您的摄影推向新的高度。",
                        "tags": ["应用", "摄影", "相机"]
                    }
                }
            },
            {
                "id": "shojinchess",
                "title": "Shojin Chess",
                "logoUrl": "images/portfolio/shojinchess.png",
                "links": [
                    {"faIcon": "fa-brands fa-apple", "href": "https://apple.com", "id": "App Store"},
                    {"faIcon": "fa-brands fa-google-play", "href": "https://googleplay.com", "id": "Google Play"}
                ],
                "locales": {
                    "en": {
                        "description": "<b>Shojin Chess</b> is an upgraded evolution of the classic strategy game, introducing dynamic power-ups and modern mechanics. This app transforms traditional chess into an exciting battlefield where players utilize special abilities alongside standard moves, adding a new layer of depth and unpredictability to every match.",
                        "tags": ["app", "game", "chess", "strategy"]
                    },
                    "es": {
                        "description": "<b>Shojin Chess</b> es una evolución mejorada del clásico juego de estrategia, introduciendo potenciadores dinámicos y mecánicas modernas. Esta app transforma el ajedrez tradicional en un emocionante campo de batalla donde los jugadores utilizan habilidades especiales, añadiendo una nueva capa de profundidad.",
                        "tags": ["aplicación", "juego", "ajedrez", "estrategia"]
                    },
                    "fr": {
                        "description": "<b>Shojin Chess</b> est une évolution améliorée du jeu de stratégie classique, introduisant des power-ups dynamiques et des mécaniques modernes. Cette application transforme les échecs traditionnels en un champ de bataille passionnant où les joueurs utilisent des capacités spéciales, ajoutant une nouvelle couche de profondeur.",
                        "tags": ["application", "jeu", "échecs", "stratégie"]
                    },
                    "zh": {
                        "description": "<b>Shojin Chess</b> 是经典策略游戏的升级进化版，引入了动态增强道具和现代机制。该应用程序将传统国际象棋转变为一个激动人心的战场，玩家可以在标准走法之外利用特殊能力，为每场比赛增添了新的深度和不可预测性。",
                        "tags": ["应用", "游戏", "国际象棋", "策略"]
                    }
                }
            }
        ],

        "social": [
        ]
    }
}