{
    "locales": {
        "en": {
            "title": "<span class='text-primary'>Professional</span> Experience",
            "description": "A look into my work experience and career journey."
        },

        "es": {
            "title": "<span class='text-primary'>Experiencia</span> Profesional",
            "description": "Un vistazo a mi experiencia laboral y trayectoria profesional."
        },

        "fr": {
            "title": "Expérience <span class='text-primary'>Professionnelle</span>",
            "description": "Un aperçu de mon expérience professionnelle et de mon parcours de carrière."
        },

        "zh": {
            "title": "<span class='text-primary'>专业</span> 经验",
            "description": "了解我的工作经验和职业之旅。"
        }
    },

    "items": [
    {
        "id": "experience_item_1",
        "place": "@link{places.coursera}",
        "period": ["2024/04", "Present"],
        "locales": {
            "en": {
                "title": "Frontend Developer",
                "description": "Project: IVY – AI Automations for Sales Teams (React.js, Redux, MUI, Flask). Designed AI-powered dashboards, helping improve sales team productivity. Built optimized UI components using React.memo and code-splitting, improving load time and responsiveness. Implemented unit & integration tests (Jest, Cypress), ensuring high-quality releases."
            },
            "es": {
                "title": "Desarrollador Frontend",
                "description": "Proyecto: IVY – Automatizaciones de IA para equipos de ventas (React.js, Redux, MUI, Flask). Diseñé paneles de control impulsados por IA, ayudando a mejorar la productividad del equipo de ventas. Construí componentes de UI optimizados usando React.memo y división de código, mejorando el tiempo de carga y la capacidad de respuesta. Implementé pruebas unitarias e integrales (Jest, Cypress), garantizando lanzamientos de alta calidad."
            },
            "fr": {
                "title": "Développeur Frontend",
                "description": "Projet : IVY – Automatisations IA pour les équipes commerciales (React.js, Redux, MUI, Flask). Conception de tableaux de bord alimentés par l'IA, contribuant à améliorer la productivité de l'équipe. Création de composants UI optimisés avec React.memo et code-splitting, améliorant les temps de chargement et la réactivité. Mise en place de tests unitaires et d'intégration (Jest, Cypress) pour garantir des livraisons de haute qualité."
            },
            "zh": {
                "title": "前端开发工程师",
                "description": "项目：IVY – 销售团队AI自动化（React.js, Redux, MUI, Flask）。设计AI驱动的仪表板，帮助提高销售团队生产力。构建优化的UI组件，使用React.memo和代码分割，提高加载时间和响应速度。实现单元和集成测试（Jest, Cypress），确保高质量发布。"
            }
        }
    },
    {
        "id": "experience_item_2",
        "place": "@link{places.adobe}",
        "period": ["2022/03", "2024/12"],
        "locales": {
            "en": {
                "title": "Senior Frontend Developer",
                "description": "Taxiye (Passenger App) – Built a custom ride-booking & delivery system (Next.js, Strapi CMS, Node.js, PostgreSQL), optimizing booking speed and user experience. ELTNT Tours & Travel – Developed a tour package booking platform (React, Ant Design, .NET), boosting sales and user engagement. Houfa Africa (Security Service) – Led frontend dev for real-time alert system (React, Tailwind, Redux, Node.js, Flutter), delivering a pixel-perfect UI."
            },
            "es": {
                "title": "Desarrollador Frontend Senior",
                "description": "Taxiye (Aplicación de Pasajeros) – Construí un sistema personalizado de reservas de viajes y entregas (Next.js, Strapi CMS, Node.js, PostgreSQL), optimizando la velocidad de reserva y la experiencia del usuario. ELTNT Tours & Travel – Desarrollé una plataforma de reservas de paquetes turísticos (React, Ant Design, .NET), aumentando las ventas y la interacción de los usuarios. Houfa Africa (Servicio de Seguridad) – Lideré el desarrollo frontend de un sistema de alertas en tiempo real (React, Tailwind, Redux, Node.js, Flutter), entregando una UI perfecta."
            },
            "fr": {
                "title": "Développeur Frontend Senior",
                "description": "Taxiye (Application Passager) – Création d'un système personnalisé de réservation de trajets et de livraisons (Next.js, Strapi CMS, Node.js, PostgreSQL), optimisant la rapidité et l'expérience utilisateur. ELTNT Tours & Travel – Développement d'une plateforme de réservation de forfaits touristiques (React, Ant Design, .NET), augmentant les ventes et l'engagement des utilisateurs. Houfa Africa (Service de Sécurité) – Supervision du développement frontend d'un système d'alerte en temps réel (React, Tailwind, Redux, Node.js, Flutter), livrant une UI parfaite."
            },
            "zh": {
                "title": "高级前端开发工程师",
                "description": "Taxiye（乘客应用）– 构建定制的乘车预订与配送系统（Next.js, Strapi CMS, Node.js, PostgreSQL），优化预订速度和用户体验。ELTNT旅游 – 开发旅游套餐预订平台（React, Ant Design, .NET），提升销售和用户参与度。Houfa Africa（安全服务）– 领导实时警报系统前端开发（React, Tailwind, Redux, Node.js, Flutter），实现像素级UI。"
            }
        }
    },
    {
        "id": "experience_item_3",
        "place": "@link{places.apple}",
        "period": ["2023/07", "2024/05"],
        "locales": {
            "en": {
                "title": "FullStack Developer",
                "description": "ReserveXp (Travel SaaS) – Developed a multi-tenant subscription-based SaaS platform (React, Node.js, MongoDB). Passio (Super App) – Led dev of a multi-service platform (e-commerce, taxi, delivery) using React, MUI, Node.js, Flutter. Curewantri (Telemedicine App) – Built subscription-based medical consultation platform (React Native, Laravel, MySQL). LiveGamer (Sports Betting) – Integrated real-time odds APIs & Stripe, streamlining transaction processing."
            },
            "es": {
                "title": "Desarrollador FullStack",
                "description": "ReserveXp (SaaS de Viajes) – Desarrollé una plataforma SaaS multi-inquilino basada en suscripciones (React, Node.js, MongoDB). Passio (Super App) – Lideré el desarrollo de una plataforma de múltiples servicios (comercio electrónico, taxi, entrega) usando React, MUI, Node.js, Flutter. Curewantri (Aplicación de Telemedicina) – Construí una plataforma de consultas médicas por suscripción (React Native, Laravel, MySQL). LiveGamer (Apuestas Deportivas) – Integré APIs de probabilidades en tiempo real y Stripe, optimizando las transacciones."
            },
            "fr": {
                "title": "Développeur FullStack",
                "description": "ReserveXp (SaaS de Voyage) – Développement d'une plateforme SaaS multi-locataire basée sur l'abonnement (React, Node.js, MongoDB). Passio (Super App) – Supervision du développement d'une plateforme multi-services (e-commerce, taxi, livraison) utilisant React, MUI, Node.js, Flutter. Curewantri (Application de Télémédecine) – Création d'une plateforme de consultation médicale par abonnement (React Native, Laravel, MySQL). LiveGamer (Paris Sportifs) – Intégration d'APIs d'odds en temps réel et Stripe, rationalisant les transactions."
            },
            "zh": {
                "title": "全栈开发工程师",
                "description": "ReserveXp（旅游SaaS）– 开发多租户订阅制SaaS平台（React, Node.js, MongoDB）。Passio（超级应用）– 领导多服务平台开发（电商、出租车、配送），使用React, MUI, Node.js, Flutter。Curewantri（远程医疗应用）– 构建订阅式医疗咨询平台（React Native, Laravel, MySQL）。LiveGamer（体育博彩）– 集成实时赔率API和Stripe，简化交易处理。"
            }
        }
    },
    {
        "id": "experience_item_4",
        "place": "@link{places.yerras}",
        "period": ["2020/10", "2022/01"],
        "locales": {
            "en": {
                "title": "Full-Stack Developer",
                "description": "Built an agriculture e-commerce platform (React, Node.js, PostgreSQL), improving digital trade efficiency. Developed financial management admin panels, streamlining transactions for SMEs."
            },
            "es": {
                "title": "Desarrollador Full-Stack",
                "description": "Construí una plataforma de comercio electrónico agrícola (React, Node.js, PostgreSQL), mejorando la eficiencia del comercio digital. Desarrollé paneles administrativos de gestión financiera, optimizando las transacciones para pymes."
            },
            "fr": {
                "title": "Développeur Full-Stack",
                "description": "Création d'une plateforme de commerce électronique agricole (React, Node.js, PostgreSQL), améliorant l'efficacité du commerce numérique. Développement de panneaux d'administration de gestion financière, rationalisant les transactions pour les PME."
            },
            "zh": {
                "title": "全栈开发工程师",
                "description": "构建农业电子商务平台（React, Node.js, PostgreSQL），提高数字贸易效率。开发财务管理后台面板，简化中小企业交易流程。"
            }
        }
    },
    {
        "id": "experience_item_5",
        "place": "@link{places.uxStudio}",
        "period": ["2019/01", "2020/09"],
        "locales": {
            "en": {
                "title": "IT Officer",
                "description": "Managed core banking IT infrastructure, ensuring reliable system uptime. Developed automation tools that improved overall efficiency."
            },
            "es": {
                "title": "Oficial de TI",
                "description": "Gestioné la infraestructura de TI bancaria principal, asegurando un tiempo de actividad confiable del sistema. Desarrollé herramientas de automatización que mejoraron la eficiencia general."
            },
            "fr": {
                "title": "Officier TI",
                "description": "Gestion de l'infrastructure informatique bancaire principale, assurant une disponibilité fiable du système. Développement d'outils d'automatisation améliorant l'efficacité globale."
            },
            "zh": {
                "title": "IT专员",
                "description": "管理核心银行IT基础设施，确保系统可靠运行时间。开发自动化工具，提高整体效率。"
            }
        }
    }
]

}